/*#############################################################################
 * 文件名   : torrent_file.hpp
 * 创建人   : teck_zhou	
 * 创建时间 : 2013年09月13日
 * 文件描述 : TorrentFile实现
 * 版权声明 : Copyright (c) 2013 BroadInter. All rights reserved.
 * ##########################################################################*/

#include "torrent_file.hpp"
#include "bc_assert.hpp"

namespace BroadCache
{

/*-----------------------------------------------------------------------------
 * 描  述: 构造函数
 * 参  数: 
 * 返回值:
 * 修  改: 
 *   时间 2013年10月8日
 *   作者 teck_zhou
 *   描述 新建
 ----------------------------------------------------------------------------*/
TorrentFile::TorrentFile()
	: total_size_(0)
{
}

/*-----------------------------------------------------------------------------
 * 描  述: 析构函数
 * 参  数: 
 * 返回值:
 * 修  改: 
 *   时间 2013年10月8日
 *   作者 teck_zhou
 *   描述 新建
 ----------------------------------------------------------------------------*/
TorrentFile::~TorrentFile()
{
}

/*-----------------------------------------------------------------------------
 * 描  述: 新增文件
 * 参  数: [in] e 文件entry
 * 返回值:
 * 修  改: 
 *   时间 2013年10月8日
 *   作者 teck_zhou
 *   描述 新建
 ----------------------------------------------------------------------------*/
void TorrentFile::AddFile(const FileEntry& e)
{
	AddFile(e.path, e.size);
}

/*-----------------------------------------------------------------------------
 * 描  述: 通过文件路径和文件大小创建文件路径
 * 参  数: [in] path file的路径
 *         [in] data file的大小
 * 返回值: 
 * 修  改: 
 *   时间 2013年10月8日
 *   作者 vicent_pan
 *   描述 
 ----------------------------------------------------------------------------*/
void TorrentFile::AddFile(const fs::path& file, uint64 size)
{
	FileEntry entry;
	entry.size = size;
	entry.path = file;
	entry.offset = total_size_;

	files_.push_back(entry);

	total_size_ += size;
}

/*-----------------------------------------------------------------------------
 * 描  述: 设置资源文件大小
 * 参  数: [in] size 文件大小
 * 返回值: 
 * 修  改: 
 *   时间 2013年10月27日
 *   作者 teck_zhou
 *   描述 创建
 ----------------------------------------------------------------------------*/
void TorrentFile::SetResourceFileSize(uint64 size)
{
	BC_ASSERT(files_.size() == 1);

	files_.front().size = size;

	total_size_ = size;
}

}